21-rails-review-pt.2/app/controllers/magazines_controller.rb

  def create
    magazine = Magazine.create!(mag_params)
---
INSERT INTO "magazines" ("title", "category", "price", "store_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "My Mag"], ["category", "Niceeeee"], ["price", 10000000], ["store_id", 2], ["created_at", "2019-03-21 15:53:27.428706"], ["updated_at", "2019-03-21 15:53:27.428706"]]

  def show
    @magazine = Magazine.find(params[:id])
---
SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]