21-rails-review-pt.2/app/controllers/stores_controller.rb

  def show
    byebug
    @store = Store.find(params[:id])
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" IN (?, ?)  [["id", 1], ["id", 2]]

  def new
    @store = Store.new
    @store.magazines.build
    @store.magazines.build
    @store.magazines.build
    @store.magazines << Magazine.new
---
INSERT INTO "stores" ("name", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Hudson News"], ["city", "Laguardia"], ["created_at", "2019-03-20 21:10:43.982533"], ["updated_at", "2019-03-20 21:10:43.982533"]]
INSERT INTO "magazines" ("title", "category", "store_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aasa"], ["category", "a"], ["store_id", 4], ["created_at", "2019-03-21 14:59:52.339472"], ["updated_at", "2019-03-21 14:59:52.339472"]]

  def create
    @store = Store.create!(store_params)
---
INSERT INTO "stores" ("name", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "fdsafasdsa"], ["city", "dasdsadasd"], ["created_at", "2019-03-21 14:59:52.338263"], ["updated_at", "2019-03-21 14:59:52.338263"]]

  def destroy
    Store.find(params[:id]).destroy
---
DELETE FROM "stores" WHERE "stores"."id" = ?  [["id", 2]]
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]