21-rails-review-pt.2/app/views/magazines/new.html.erb


  <%= f.collection_select :store_id, Store.all, :id, :name, {prompt: "You must Choose, Batman"} %>
---
SELECT "stores".* FROM "stores"