21-rails-review-pt.2/app/views/stores/show.erb

<ul>
  <% @store.magazines.each do |mag| %>
---
SELECT "magazines".* FROM "magazines" WHERE "magazines"."store_id" = ?  [["store_id", 2]]